{
    "broadArea": {
        "name": "Biotechnology and Biomedical Engineering",
        "link": "https://www.vlab.co.in/broad-area-biotechnology-and-biomedical-engineering",
        "code": "BIO"
    },
    "lab": "Bioinformatics and Computational Biology",
    "lab_display_name": "Bioinformatics and Computational Biology",
    "phase": "3-ext",
    "collegeName": "AMRT",
    "baseUrl": "bcb-au.vlabs.ac.in",
    "introduction": "The rapid advancements in bioinformatics and computational biology have established these fields as essential components of modern biotechnology and biomedical research. To address the growing demand for accessible and practical training in these interdisciplinary areas, this proposal outlines the development of a comprehensive Bioinformatics and Computational Biology Virtual Laboratory. This initiative aims to provide students with an immersive and interactive learning experience, enabling them to grasp complex concepts, perform simulations, and analyze real-world data efficiently.The proposed virtual lab will serve as an educational bridge, equipping undergraduate students with the skills to interpret bioinformatics data, apply advanced computational tools, and gain familiarity with methodologies like machine learning, molecular dynamics, and next-generation sequencing. By leveraging cutting-edge virtual lab technologies, this platform will complement traditional classroom teaching and ensure accessibility to students from diverse educational backgrounds.",
    "experiments": [
        {
            "name": "Basic machine learning using the WEKA tool",
            "short-name": "weka-tool",
            "repo": "https://github.com/virtual-labs/exp-weka-tool-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "Browsing genetic variation databases such as dbSNP, CLIN Var",
            "short-name": "dbsnp-clin-var",
            "repo": "https://github.com/virtual-labs/exp-browsing-genetic-variation-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "Similarity search using BLAST",
            "short-name": "search-blast",
            "repo": "https://github.com/virtual-labs/exp-blast-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "Visualization of Protein Structure",
            "short-name": "protein-structure",
            "repo": "https://github.com/virtual-labs/exp-visualization-protein-structure-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "Molecular Dynamics Simulation: GROMACS",
            "short-name": "gromacs",
            "repo": "https://github.com/virtual-labs/exp-gromacs-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "Basic Algorithms in Bioinformatics",
            "short-name": "algorithms-bioinformatics",
            "repo": "https://github.com/virtual-labs/exp-bioinformatics-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "Conversion of sequence from one database format to another using file format converter",
            "short-name": "file-format-converter",
            "repo": "https://github.com/virtual-labs/exp-file-format-converter-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "An introduction to Next Generation Sequencing (NGS)",
            "short-name": "next-generation-sequencing",
            "repo": "https://github.com/virtual-labs/exp-next-generation-sequencing-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "To find out the number of times a sequence is repeated in a given DNA sequence",
            "short-name": "dna-sequence",
            "repo": "https://github.com/virtual-labs/exp-dna-sequence-au",
            "tag": "v1.0.1",
            "deploy": true
        },
        {
            "name": "To analyze the sequence of a given DNA and find out sequence composition",
            "short-name": "sequence-composition",
            "repo": "https://github.com/virtual-labs/exp-sequence-composition-au",
            "tag": "v1.0.1",
            "deploy": true
        }
    ],
    "targetAudience": {
        "UG": [
            "1st Year",
            "2nd Year",
            "3rd Year"
        ],
      "PG":["1st Year",
      "2nd Year"]
    },
    "objective": "The goal of proposed virtual laboratories is to achieve a conceptual understanding of standard protocols and tools in biotechnology and biomedical engineering at an advanced level that may be useful in interdisciplinary fields of science and technology. The student with the knowledge of the basic laboratory content (including animation and simulation) can scientifically explain and solve various problems in biotechnology and can tackle new developments and breakthroughs efficiently in science and engineering technology. The labs are being designed to make teaching easier in colleges where teachers coming from interdisciplinary domains can handle the courses to teach visualization and interpretation of bioinformatics-related data sciences with graphical illustrations and usage simplicity. The labs can be extended as a course manual or reference textbook for bioscience students in biology, biotechnology, and microbiology.",
    "courseAlignment": {
        "description": "All institutes who offers a course in Bioinformatics, Computational Biology, Biosciences, and Computer sciences"
    }
}
